[
  {
    "rank": 1,
    "closer": "Kaz Sasaki",
    "comment": "As best closer in Mariner history, carries little baggage, except for that which he tripped over (wink wink).",
    "year": "2000-03",
    "saves": 129
  },
  {
    "rank": 2,
    "closer": "J.J. Putz",
    "comment": "Never officially named closer by Mike Hargrove after replacing Eddie Guardado, so those 40 saves in 2007 might never have actually happened.",
    "year": "2003-08",
    "saves": 101
  },
  {
    "rank": 3,
    "closer": "Mike Schooler",
    "comment": "Might be considered Patient Zero when it comes to angst-inducing Mariners closers – or in Lou Piniella’s case, Impatient Zero.",
    "year": "1988-92",
    "saves": 98
  },
  {
    "rank": 4,
    "closer": "David Aardsma",
    "comment": "On the short list of good Jack Zduriencik trades, acquiring Aardsma for Fabian Williamson – yes, THE Fabian Williamson – is in the upper half.",
    "year": "2009-10",
    "saves": 69
  },
  {
    "rank": 5,
    "closer": "Tom Wilhelmsen",
    "comment": "Needs to one day close for Oakland so The Bartender can become the BART-ender.",
    "year": "2011-16",
    "saves": 68
  },
  {
    "rank": 6,
    "closer": "Norm Charlton",
    "comment": "As a Nasty Boy helped win a title for Piniella, but never could replicate that feat in 3 Seattle stints with Lou.",
    "year": "1993-97, 2001",
    "saves": 67
  },
  {
    "rank": 7,
    "closer": "Fernando Rodney",
    "comment": "Logan Morrison might still be looking for that last Rodney arrow.",
    "year": "2014-15",
    "saves": 64
  },
  {
    "rank": 8,
    "closer": "Eddie Guardado",
    "comment": "By the end, “Every Day Eddie” had evolved into “Let’s Wait ‘Til Tomorrow Guardado.”",
    "year": "2004-06",
    "saves": 59
  },
  {
    "rank": 9,
    "closer": "Bobby Ayala",
    "comment": "Forever grateful to A-Rod for bolting to Texas and wresting away “Most Hated Mariner” title.",
    "year": "1994-98",
    "saves": 56
  },
  {
    "rank": 10,
    "closer": "Bill Caudill",
    "comment": "Was known to playfully handcuff teammates to lockers, a technique Piniella borrowed for his relief staff.",
    "year": "1982-83",
    "saves": 52
  },
  {
    "rank": 11,
    "closer": "Brandon League",
    "comment": "Answer to trivia question, “Name last Mariner closer before Rodney to make the All-Star team.”",
    "year": "2010-12",
    "saves": 52
  },
  {
    "rank": 12,
    "closer": "Shane Rawley",
    "comment": "Had a long and fairly prosperous career as a starter after getting closing out of his system in Seattle.",
    "year": "1978-81",
    "saves": 36
  },
  {
    "rank": 13,
    "closer": "Edwin Nunez",
    "comment": "Has to be considered second-greatest closer named Edwin in Mariners history.",
    "year": "1982-88",
    "saves": 35
  },
  {
    "rank": 14,
    "closer": "Mike Jackson",
    "comment": "Has to be considered best player sort of sharing name of superstar singer since Pirates’ Jim Morrison.",
    "year": "1988-91, 1996",
    "saves": 34
  },
  {
    "rank": 15,
    "closer": "Jose Mesa",
    "comment": " If it’s any consolation, fans in Cleveland have even worse memories of Mesa.",
    "year": "1999-2000",
    "saves": 34
  }
]